/**
 * <h1 color="green">Інтерфейс Composition</h1>
 * Інтерфейс, який представляє графічну композицію — лінію.
 * <p>
 * Лінія задається координатами у сантиметрах, які задаються цілими числамми.
 * </p>
 * <p>
 * Клас {@link PointToLineAdapter} реалізує цей інтерфейс, використовуючи точки.
 * </p>
 * <h1>Опис методів</h1>
 * <ul>
 *     <li>{@link #setX(double, double)} - Встановлює координати X для початкової та кінцевої точки лінії.</li>
 *     <li>{@link #setY(double, double)} - Встановлює координати Y для початкової та кінцевої точки лінії.</li>
 *     <li>{@link #draw()} - Відповідає за малювання лінії.</li>
 * </ul>
 *
 * @see PointToLineAdapter
 * @see Primitive
 * @see Point
 */
public interface Composition {
    /**
     * Встановлює координати X для початку та кінця лінії в сантиметрах.
     * @param x1 координата X початкової точки
     * @param x2 координата X кінцевої точки
     */
    void setX(double x1, double x2);

    /**
     * Встановлює координати Y для початку та кінця лінії в сантиметрах.
     *
     * @param y1 координата Y початкової точки
     * @param y2 координата Y кінцевої точки
     */
    void setY(double y1, double y2);

    /**
     * Малює лінію.
     */
    void draw();
}