/**
 * <h1 color="green">Інтерфейс Primitive</h1>
 * Інтерфейс, який представляє графічний примітив — точку.
 * <p>
 * Точка має координати у пікселях, які задаються цілими числами.
 * Метод {@link Primitive#draw()} відповідає за зображення точки на екрані.
 * </p>
 * <h1>Опис методів</h1>
 * <ul>
 *     <li>{@link #setX(int)} - Встановлює X-координату точки в пікселях.</li>
 *     <li>{@link #setY(int)} - Встановлює Y-координату точки в пікселях.</li>
 *     <li>{@link #draw()} - Відповідає за малювання точки.</li>
 * </ul>
 * @see Point
 */

public interface Primitive {
    /**
     * Встановлює координату X точки в пікселях.
     * @param x координата X в пікселях
     */
    void setX(int x);

    /**
     * Встановлює координату Y точки в пікселях.
     * @param y координата Y в пікселях
     */
    void setY(int y);

    /**
     * Малює точку.
     */
    void draw();
}